CSI API ETABS v1

# cDCoSP63133302011GetPreference Method

---

Retrieves the value of a concrete design preference item.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetPreference(
    	int Item,
    	ref double Value
    )

    Function GetPreference (
    	Item As Integer,
    	ByRef Value As Double
    ) As Integer

    Dim instance As cDCoSP63133302011
    Dim Item As Integer
    Dim Value As Double
    Dim returnValue As Integer

    returnValue = instance.GetPreference(Item,
    	Value)

    int GetPreference(
    	int Item,
    	double% Value
    )

    abstract GetPreference :
            Item : int *
            Value : float byref -> int

#### Parameters

Item

    Type: SystemInt32
This is an integer between 1 and 47, inclusive, indicating the preference item
considered.

  1. Multi-response case design
  2. Number of interaction curves
  3. Number of interaction points
  4. Consider minimum eccentricity
  5. Consider torsion
  6. (qsw,1*Z1)/(Rs*As,1)
  7. Corner rebar fraction top
  8. Corner rebar fraction bottom
  9. Relative Humidity (%)
  10. Moisture Content (fraction)
  11. Gamma_b
  12. Gamma_bt
  13. Gamma_b1 Short Term
  14. Gamma_b1 Long Term
  15. Gamma_b2
  16. Gamma_b3 Beams
  17. Gamma_b3 Columns
  18. Gamma_b4
  19. Gamma_b5
  20. Gamma_S
  21. Gamma_S1
  22. Pattern Live Load Factor
  23. Utilization Factor Limit
  24. Live Load Duration Factor
  25. Snow Load Duration Factor
  26. Reliability Factor, Gamma_n
  27. Seismic Factor, m_tr,strength
  28. Seismic Factor, m_tr,shear
  29. Site Seismicity

  31. Ignore Beneficial Pu for Beam Design
  32. Consider Crack Analysis
  33. Crack Width Limit Full Load, a_crc,ult (mm)
  34. Crack Width Limit Long Term, a_crc,l,ult (mm)
  35. Longitudinal Rebar Size Top
  36. Longitudinal Rebar Size Bottom
  37. Is Longitudinal Rebar Ribbed
  38. User Defined Allowable PT Stresses
  39. Concrete Strength Ratio at Transfer f'ci / f'c
  40. Transfer: Top Fiber Tensile Stress / f'ci^(1/2)
  41. Transfer: Bottom Fiber Tensile Stress / f'ci^(1/2)
  42. Transfer: Extreme Fiber Compressive Stress / f'ci
  43. Final: Top Fiber Tensile Stress / f'c^(1/2)
  44. Final: Bottom Fiber Tensile Stress / f'c^(1/2)
  45. Final: Extreme Fiber Compressive Stress / f'c
  46. Sustained: Extreme Fiber Compressive Stress / f'c
  47. Sustained: Fraction of Live Load Considered

Value

    Type: SystemDouble
The value of the considered preference item.

  1. Multi-response case design
     * 1 = Envelopes
     * 2 = Step-by-Step
     * 3 = Last Step
     * 4 = Enveleopes -- All
     * 5 = Step-by-Step -- All
  2. Number of interaction curves

Value >= 4 and divisable by 4

  3. Number of interaction points

Value >= 5 and odd

  4. Consider minimum eccentricity
     * 0 = No
     * Any other value = Yes
  5. Consider torsion
     * 0 = No
     * Any other value = Yes
  6. (qsw,1*Z1)/(Rs*As,1)

Value > 0

  7. Corner rebar fraction top

Value > 0

  8. Corner rebar fraction bottom

Value > 0

  9. Relative Humidity (%)

Value > 0

  10. Moisture Content (fraction)

Value > 0

  11. Gamma_b

Value > 0

  12. Gamma_bt

Value > 0

  13. Gamma_b1 Short Term

Value > 0

  14. Gamma_b1 Long Term

Value > 0

  15. Gamma_b2

Value > 0

  16. Gamma_b3 Beams

Value > 0

  17. Gamma_b3 Columns

Value > 0

  18. Gamma_b4

Value > 0

  19. Gamma_b5

Value > 0

  20. Gamma_b4

Value > 0

  21. Gamma_S

Value > 0

  22. Gamma_S1

Value > 0

  23. Pattern Live Load Factor

Value > 0

  24. Utilization Factor Limit

Value > 0

  25. Live Load Duration Factor

Value > 0

  26. Snow Load Duration Factor

Value > 0

  27. Reliability Factor, Gamma_n

Value > 0

  28. Seismic Factor, m_tr,strength

Value > 0

  29. Seismic Factor, m_tr,shear

Value > 0

  30. Site Seismicity
     * 1 = Site Seismicity 9
     * 2 = Site Seismicity 8
     * 3 = Site Seismicity 7
     * 4 = Non-seismic

  31. Ignore Beneficial Pu for Beam Design
     * 0 = No
     * Any other value = Yes
  32. Consider Crack Analysis
     * 0 = No
     * Any other value = Yes
  33. Crack Width Limit Full Load, a_crc,ult (mm)

Value > 0

  34. Crack Width Limit Long Term, a_crc,l,ult (mm)

Value > 0

  35. Longitudinal Rebar Size Top

Value is the index in the list of the rebar defined in the Reinforcing Bar
Sizes form

  36. Longitudinal Rebar Size Bottom

Value is the index in the list of the rebar defined in the Reinforcing Bar
Sizes form

  37. Is Longitudinal Rebar Ribbed
     * 0 = No
     * Any other value = Yes
  38. User Defined Allowable PT Stresses
     * 0 = No
     * Any other value = Yes
  39. Concrete Strength Ratio at Transfer f'ci / f'c

Value > 0

  40. Transfer: Top Fiber Tensile Stress / f'ci^(1/2)

Value > 0

  41. Transfer: Bottom Fiber Tensile Stress / f'ci^(1/2)

Value > 0

  42. Transfer: Extreme Fiber Compressive Stress / f'ci

Value > 0

  43. Final: Top Fiber Tensile Stress / f'c^(1/2)

Value > 0

  44. Final: Bottom Fiber Tensile Stress / f'c^(1/2)

Value > 0

  45. Final: Extreme Fiber Compressive Stress / f'c

Value > 0

  46. Sustained: Extreme Fiber Compressive Stress / f'c

Value > 0

  47. Sustained: Fraction of Live Load Considered

Value > 0

#### Return Value

Type: Int32
Returns zero if the item is successfully retrieved; otherwise it returns a
nonzero value.

Remarks

Examples

VB

Copy

    Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Value As Double

    'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

    'start ETABS application
      ret = EtabsObject.ApplicationStart()

    'create SapModel object
       SapModel = EtabsObject.SapModel

    'initialize model
       ret = SapModel.InitializeNewModel()

    'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)

    'create new concrete frame section property
       ret = SapModel.PropFrame.SetRectangle("R1", "4000Psi", 20, 12)

    'set frame section property
       ret = SapModel.FrameObj.SetSection("8", "R1")

    'set concrete design code
       ret = SapModel.DesignConcrete.SetCode("SP 63.13330.2012")

    'run analysis
       System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
       ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
       ret = SapModel.Analyze.RunAnalysis

    'start concrete design
       ret = SapModel.DesignConcrete.StartDesign()

    'get preference item
       ret = SapModel.DesignConcrete.SP63133302011.GetPreference(35, Value)

    'close ETABS
       EtabsObject.ApplicationExit(False)

    'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing

    End Sub

See Also

#### Reference

cDCoSP63133302011 Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com